Avraham565/smart-kosher/panel/sdkconfig.defaults
# CrowPanel Advance 7" (ESP32-S3-WROOM-1-N16R8) — panel UI firmware
CONFIG_IDF_TARGET="esp32s3"

# Flash: proven settings on this exact board (all MicroPython-era flashes)
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Octal PSRAM (8MB) — RGB frame buffers live here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Required with RGB bounce buffers + PSRAM frame buffers (esp_lcd rgb docs:
# "screen drift" mitigation must pair bounce buffers with 64B cache lines)
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# esp_lvgl_port recommendation
CONFIG_FREERTOS_HZ=1000

# Extra safety net from esp_lcd: realign DMA at each vsync if it ever slips
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y

# --- LVGL (managed component, configured via Kconfig) ---
CONFIG_LV_COLOR_DEPTH_16=y
# Hebrew / RTL
CONFIG_LV_USE_BIDI=y
CONFIG_LV_FONT_DEJAVU_16_PERSIAN_HEBREW=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_28=y
